Revit 2027 API
BuiltInFailures.WallFailures.FaceWallBadType Property
 Wall type '[Type Name]' is incompatible with picked face. Only basic wall types are accepted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FaceWallBadType { get; }
Public Shared ReadOnly Property FaceWallBadType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FaceWallBadType {
	FailureDefinitionId^ get ();
}
static member FaceWallBadType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace